In [1]:
from pyhive import hive
import pymysql
conn = hive.Connection(host='127.0.0.1', port=10000, username='hadoop')
cursor = conn.cursor()

In [2]:
def exec_sql(sql):
    cursor.execute(sql)
    for result in cursor.fetchall():
        print(result)

# create_relation_bet_degree_and_class(学历和种类的关系)

In [3]:
cursor.execute("DROP TABLE IF EXISTS relation_bet_degree_and_class")

In [4]:
create_relation_bet_degree_and_class_sql = '''create table relation_bet_degree_and_class(class string,degree_high float,degree_low float)'''

In [5]:
cursor.execute(create_relation_bet_degree_and_class_sql)

In [6]:
del create_relation_bet_degree_and_class_sql

爱情片

In [7]:
t_romance_sql = '''insert into table relation_bet_degree_and_class SELECT 't_romance',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_romance =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_romance =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_romance =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_romance =1) t8'''

In [8]:
cursor.execute(t_romance_sql)

In [9]:
del t_romance_sql

喜剧

In [10]:
t_comedy_sql = '''insert into table relation_bet_degree_and_class SELECT 't_comedy',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_comedy =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_comedy =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_comedy =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_comedy =1) t8'''

In [11]:
cursor.execute(t_comedy_sql)

In [12]:
del t_comedy_sql

动画

In [13]:
t_animate_sql = '''insert into table relation_bet_degree_and_class SELECT 't_animate',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_animate =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_animate =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_animate =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_animate =1) t8'''

In [14]:
cursor.execute(t_animate_sql)

In [15]:
del t_animate_sql

剧情

In [16]:
t_plot_sql = '''insert into table relation_bet_degree_and_class SELECT 't_plot',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_plot =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_plot =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_plot =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_plot =1) t8'''

In [17]:
cursor.execute(t_plot_sql)

In [18]:
del t_plot_sql

恐怖

In [19]:
t_horror_sql = '''insert into table relation_bet_degree_and_class SELECT 't_horror',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_horror =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_horror =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_horror =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_horror =1) t8'''

In [20]:
cursor.execute(t_horror_sql)

In [21]:
del t_horror_sql

惊悚

In [22]:
t_thriller_sql = '''insert into table relation_bet_degree_and_class SELECT 't_thriller',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_thriller =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_thriller =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_thriller =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_thriller =1) t8'''

In [23]:
cursor.execute(t_thriller_sql)

In [24]:
del t_thriller_sql

科幻

In [25]:
t_science_sql = '''insert into table relation_bet_degree_and_class SELECT 't_science',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_science =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_science =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_science =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_science =1) t8'''

In [26]:
cursor.execute(t_science_sql)

In [27]:
del t_science_sql

动作

In [28]:
t_action_sql = '''insert into table relation_bet_degree_and_class SELECT 't_action',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_action =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_action =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_action =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_action =1) t8'''

In [29]:
cursor.execute(t_action_sql)

In [30]:
del t_action_sql

悬疑

In [31]:
t_suspense_sql = '''insert into table relation_bet_degree_and_class SELECT 't_suspense',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_suspense =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_suspense =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_suspense =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_suspense =1) t8'''

In [32]:
cursor.execute(t_suspense_sql)

In [33]:
del t_suspense_sql

犯罪

In [34]:
t_crime_sql = '''insert into table relation_bet_degree_and_class SELECT 't_crime',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_crime =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_crime =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_crime =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_crime =1) t8'''

In [35]:
cursor.execute(t_crime_sql)

In [36]:
del t_crime_sql

冒险

In [37]:
t_adventure_sql = '''insert into table relation_bet_degree_and_class SELECT 't_adventure',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_adventure =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_adventure =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_adventure =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_adventure =1) t8'''

In [38]:
cursor.execute(t_adventure_sql)

In [39]:
del t_adventure_sql

战争

In [40]:
t_war_sql = '''insert into table relation_bet_degree_and_class SELECT 't_war',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_war =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_war =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_war =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_war =1) t8'''

In [41]:
cursor.execute(t_war_sql)

In [42]:
del t_war_sql

奇幻

In [43]:
t_fantasy_sql = '''insert into table relation_bet_degree_and_class SELECT 't_fantasy',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_fantasy =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_fantasy =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_fantasy =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_fantasy =1) t8'''

In [44]:
cursor.execute(t_fantasy_sql)

In [45]:
del t_fantasy_sql

运动

In [46]:
t_sports_sql = '''insert into table relation_bet_degree_and_class SELECT 't_sports',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_sports =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_sports =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_sports =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_sports =1) t8'''

In [47]:
cursor.execute(t_sports_sql)

In [48]:
del t_sports_sql

家庭

In [49]:
t_family_sql = '''insert into table relation_bet_degree_and_class SELECT 't_family',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_family =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_family =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_family =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_family =1) t8'''

In [50]:
cursor.execute(t_family_sql)

In [51]:
del t_family_sql

古装

In [52]:
t_costume_sql = '''insert into table relation_bet_degree_and_class SELECT 't_costume',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_costume =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_costume =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_costume =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_costume =1) t8'''

In [53]:
cursor.execute(t_costume_sql)

In [54]:
del t_costume_sql

武侠

In [55]:
t_sword_sql = '''insert into table relation_bet_degree_and_class SELECT 't_sword',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_sword =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_sword =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_sword =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_sword =1) t8'''

In [56]:
cursor.execute(t_sword_sql)

In [57]:
del t_sword_sql

西部

In [58]:
t_cowboy_sql = '''insert into table relation_bet_degree_and_class SELECT 't_cowboy',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_cowboy =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_cowboy =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_cowboy =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_cowboy =1) t8'''

In [59]:
cursor.execute(t_cowboy_sql)

In [60]:
del t_cowboy_sql

历史

In [61]:
t_history_sql = '''insert into table relation_bet_degree_and_class SELECT 't_history',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_history =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_history =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_history =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_history =1) t8'''

In [62]:
cursor.execute(t_history_sql)

In [63]:
del t_history_sql

传记

In [64]:
t_biography_sql = '''insert into table relation_bet_degree_and_class SELECT 't_biography',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_biography =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_biography =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_biography =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_biography =1) t8'''

In [65]:
cursor.execute(t_biography_sql)

In [66]:
del t_biography_sql

歌舞

In [67]:
t_dance_sql = '''insert into table relation_bet_degree_and_class SELECT 't_dance',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_dance =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_dance =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_dance =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_dance =1) t8'''

In [68]:
cursor.execute(t_dance_sql)

In [69]:
del t_dance_sql

黑色电影

In [70]:
t_dark_sql = '''insert into table relation_bet_degree_and_class SELECT 't_dark',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_dark =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_dark =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_dark =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_dark =1) t8'''

In [71]:
cursor.execute(t_dark_sql)

In [72]:
del t_dark_sql

短片

In [73]:
t_short_sql = '''insert into table relation_bet_degree_and_class SELECT 't_short',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_short =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_short=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_short=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_short=1) t8'''

In [74]:
cursor.execute(t_short_sql)

In [75]:
del t_short_sql

纪录片

In [76]:
t_documentary_sql = '''insert into table relation_bet_degree_and_class SELECT 't_documentary',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_documentary =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_documentary=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_documentary=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_documentary=1) t8'''

In [77]:
cursor.execute(t_documentary_sql)

In [78]:
del t_documentary_sql

其他

In [79]:
t_others_sql = '''insert into table relation_bet_degree_and_class SELECT 't_others',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.t_others =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.t_others=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.t_others=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.t_others=1) t8'''

In [80]:
cursor.execute(t_others_sql)

In [81]:
del t_others_sql

大陆

In [82]:
c_Mainland_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Mainland',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Mainland =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Mainland=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Mainland=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Mainland=1) t8'''

In [83]:
cursor.execute(c_Mainland_sql)

In [84]:
del c_Mainland_sql

美国

In [85]:
c_America_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_America',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_America =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_America=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_America=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_America=1) t8'''

In [86]:
cursor.execute(c_America_sql)

In [87]:
del c_America_sql

韩国

In [88]:
c_Korea_sql ='''insert into table relation_bet_degree_and_class SELECT 'c_Korea',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Korea =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Korea=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Korea=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Korea=1) t8'''

In [89]:
cursor.execute(c_Korea_sql)

In [90]:
del c_Korea_sql

日本

In [91]:
c_Japan_sql ='''insert into table relation_bet_degree_and_class SELECT 'c_Japan',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Japan =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Japan=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Japan=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Japan=1) t8'''

In [92]:
cursor.execute(c_Japan_sql)

In [93]:
del c_Japan_sql

香港

In [94]:
c_Hongkong_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Hongkong',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Hongkong =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Hongkong=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Hongkong=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Hongkong=1) t8'''

In [95]:
cursor.execute(c_Hongkong_sql)

In [96]:
del c_Hongkong_sql

台湾

In [97]:
c_Taiwan_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Taiwan',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Taiwan =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Taiwan=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Taiwan=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Taiwan=1) t8'''

In [98]:
cursor.execute(c_Taiwan_sql)

In [99]:
del c_Taiwan_sql

泰国

In [100]:
c_Thailand_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Thailand',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Thailand =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Thailand=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Thailand=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Thailand=1) t8'''

In [101]:
cursor.execute(c_Thailand_sql)

In [102]:
del c_Thailand_sql

印度

In [103]:
c_India_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_India',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_India =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_India=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_India=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_India=1) t8'''

In [104]:
cursor.execute(c_India_sql)

In [105]:
del c_India_sql

法国

In [106]:
c_France_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_France',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_France =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_France=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_France=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_France=1) t8'''

In [107]:
cursor.execute(c_France_sql)

In [108]:
del c_France_sql

英国

In [109]:
c_England_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_England',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_England =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_England=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_England=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_England=1) t8'''

In [110]:
cursor.execute(c_England_sql)

In [111]:
del c_England_sql

俄罗斯

In [112]:
c_Russia_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Russia',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Russia =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Russia=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Russia=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Russia=1) t8'''

In [113]:
cursor.execute(c_Russia_sql)

In [114]:
del c_Russia_sql

意大利

In [115]:
c_Italy_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Italy',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Italy =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Italy =1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Italy =1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Italy =1) t8'''

In [116]:
cursor.execute(c_Italy_sql)

In [117]:
del c_Italy_sql

西班牙

In [118]:
c_Spain_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Spain',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Spain =1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Spain=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Spain=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Spain =1) t8'''

In [119]:
cursor.execute(c_Spain_sql)

In [120]:
del c_Spain_sql

德国

In [121]:
c_Germany_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Germany',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Germany=1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Germany=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Germany=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Germany=1) t8'''

In [122]:
cursor.execute(c_Germany_sql)

In [123]:
del c_Germany_sql

波兰

In [124]:
c_Poland_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Poland',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Poland=1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Poland=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Poland=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Poland=1) t8'''

In [125]:
cursor.execute(c_Poland_sql)

In [126]:
del c_Poland_sql

澳大利亚

In [127]:
c_Australia_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Australia',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Australia=1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Australia=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Australia=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Australia=1) t8'''

In [128]:
cursor.execute(c_Australia_sql)

In [129]:
del c_Australia_sql

伊朗

In [132]:
c_Iran_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Iran',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Iran=1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Iran=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Iran=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Iran=1) t8'''

In [133]:
cursor.execute(c_Iran_sql)

In [134]:
del c_Iran_sql

其他

In [135]:
c_Others_sql = '''insert into table relation_bet_degree_and_class SELECT 'c_Others',(t2.v / t4.s) * 100.0,(t6.v / t8.s) * 100.0 FROM (SELECT SUM(t1.degree_high) AS v FROM film44 t1 WHERE t1.c_Others=1) t2 JOIN (SELECT count(t3.degree_high) as s FROM film44 t3 WHERE t3.c_Others=1) t4 JOIN (SELECT SUM(t5.degree_low) AS v FROM film44 t5 WHERE t5.c_Others=1) t6 JOIN (SELECT count(t7.degree_low) as s FROM film44 t7 WHERE t7.c_Others=1) t8'''

In [136]:
cursor.execute(c_Others_sql)

In [137]:
del c_Others_sql